---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.GetRibbonPanels(Autodesk.Revit.UI.Tab)
source: html/3bd3fa1d-dc68-86a7-86fb-c5fe91bb9491.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.GetRibbonPanels Method

## Syntax (C#)
```csharp
public override List<RibbonPanel> GetRibbonPanels(
	Tab tab
)
```

## Parameters
- **tab** (`Autodesk.Revit.UI.Tab`)